{"success":true,"data":[{"id":"64900","title":"Not explicitly mentioned in the provided text.","description":"Grade:\nG3\nVacancy no.:\nDC/Karachi/P/2025/24\nPublication date: 25-Nov-2025\nApplication deadline (\nmidnight local time\n): 07-Dec-2025\nJob ID:\n13394\nDepartment:\nRO-Asia and the Pacific\nOrganization Unit:\nCO-Islamabad\nLocation:\nKarachi\nContract type:\nFixed Term\nContract duration:\n12 months\nUnder article 4.2, paragraph (e) of the Staff Regulations, the filling of vacancies in technical cooperation projects does not fall under Annex I of the Staff Regulations and is made by direct selection by the Director-General.\nIn order to support the best informed process in the filling of the above-mentioned vacancy by direct selection, the ILO invites interested candidates to submit their application online by the above date.\nThe following are eligible to apply:\nILO Internal candidates in accordance with paragraphs 31 and 32 of Annex I of the Staff Regulations.\nExternal candidates*\n*The recruitment process for General Service positions is subject to specific local recruitment criteria.\nThe ILO may only offer a contract to persons who have a valid residency status, work permit liscence in Pakistan.\nThe ILO values diversity among its staff and welcomes applications from qualified female candidates. We also encourage applicants with disabilities. If you are unable to complete our online application form due to a disability, please send an email to\nilojobs@ilo.org\n.\nTechnical cooperation appointments are not expected to lead to a career in the ILO and they do not carry any expectation of renewal or conversion to any other type of appointment in the Organization.\nA one-year fixed-term contract will be given.\nExtensions of technical cooperation contracts are subject to various elements including the following: availability of funds, continuing need of the functions and satisfactory conduct and performance.\n*Conditions of employment for external candidates: In conformity with existing ILO practice, the appointment of an external candidate will normally be made at the first step of this grade.","job_labels":"Technical Cooperation, Recruitment Process, Contract Management, Diversity And Inclusion, Eligibility Criteria, Fixed-Term Employment, Residency Status, Performance Evaluation, Organizational Regulations, Application Process, Candidate Selection, Local Recruitment Criteria, Staff Regulations, Project Support","short_agency":"ILO","long_agency":"International Labour Organization","duty_station":"Karachi","duty_country":"Pakistan","up_grade":"G3","posting_date":"2025-11-25T00:00:00","apply_until":"2025-12-07T23:59:59","url":"https://jobs.ilo.org/job/Senior-Driver/13394-en_GB","is_active":false,"is_expired":"1","days_remaining":12,"status":"archived","urgency":"normal","archived":"1","primary_category":null,"secondary_categories":[],"classification_confidence":null,"classification_reasoning":[],"is_user_corrected":false,"user_corrected_by":null,"user_corrected_at":null,"classified_at":null,"is_ambiguous_category":false,"emerging_terms_found":[]},{"id":"64899","title":"Programme Policy Officer (Coordination), SC10, Dhaka","description":"DEADLINE FOR APPLICATIONS 1 December 2025-23:59-GMT+06:00 Bangladesh Standard Time (Dhaka) WFP celebrates and embraces diversity. It is committed to the principle of equal employment opportunity for all its employees and encourages qualified candidates to apply irrespective of race, colour, national origin, ethnic or social background, genetic information, gender, gender identity and/or expression, sexual orientation, religion or belief, HIV status or disability. ABOUT WFP The World Food Programme is the world’s largest humanitarian organization saving lives in emergencies and using food assistance to build a pathway to peace, stability and prosperity, for people recovering from conflict, disasters and the impact of climate change. At WFP, people are at the heart of everything we do and the vision of the future WFP workforce is one of diverse, committed, skilled, and high performing teams, selected on merit, operating in a healthy and inclusive work environment, living WFP's values (Integrity, Collaboration, Commitment, Humanity, and Inclusion) and working with partners to save and change the lives of those WFP serves. To learn more about WFP, visit our website: https://www.wfp.org and follow us on social media to keep up with our latest news: YouTube, LinkedIn, Instagram, Facebook, Twitter, TikTok. WHY JOIN WFP? WFP is a 2020 Nobel Peace Prize Laureate. WFP offers a highly inclusive, diverse, and multicultural working environment. WFP invests in the personal &amp; professional development of its employees through a range of training, accreditation, coaching, mentorship, and other programs as well as through internal mobility opportunities. A career path in WFP provides an exciting opportunity to work across the various country, regional and global offices around the world, and with passionate colleagues who work tirelessly to ensure that effective humanitarian assistance reaches millions of people across the globe. We offer an attractive compensation package (please refer to the Terms and Conditions section of this vacancy announcement). The position will provide strategic coordination support to the Deputy Country Director to ensure the effective and timely implementation of the Country Strategic Plan (CSP). Particular emphasis will be placed on advancing cross-cutting priorities, fostering integration across programmatic areas, and strengthening collaboration among internal and external stakeholders to achieve CSP objectives. KEY ACCOUNTABILITIES (not all-inclusive, within delegated authority): Under the overall guidance and direct supervision of the Deputy Country Director, the Programme Policy Officer (Coordination) will be responsible for the following duties: 1. Localize the WFP Country Strategic Plan (CSP) within Country Office (CO) and in collaboration with Government of Bangladesh, UN, NGO, and other partners, and support development of the Bangladesh CSP. 2. Identify and engage key stakeholders to facilitate full CSP implementation. 3. Identify strategic linkages and entry points between the WFP CSP and Government of Bangladesh’s priorities and develop roadmap for stakeholder engagement and act as liaison to facilitate related engagements. 4. Identify strategic opportunities for WFP positioning within the United Nations Sustainable Development Cooperation Framework (UNSCDF) coordinate participation in relevant groups and inputs to related reports acting as liaison to facilitate engagements. 5. Serve as CO focal person for Sustainable Development Goals (SDG) support to Government of Bangladesh, including on food systems. 6. Support the development of partnerships and joint events with member states, civil society and intergovernmental organizations to advocate for the SDGs and Zero Hunger on the global agenda, advancing WFP priorities and objectives. Serve as CO focal person for innovation. 7. Use data driven analysis to propose options to expand support from existing partners and to scope new partners, guided by programmatic assessment and context-specific analysis, with the aim to enhance the impact of WFP’s work and diversify the resource base. 8. Solicit inputs from other functional entities, Regional Offices and COs on WFP’s programmatic offering that can gain traction with individual partner audiences, conduct analysis and draft quality briefs to support of outreach opportunities. Support Programme Units with Partnership Engagement strategies and ensure quality control of related outputs. 9. Perform any other tasks as assigned. QUALIFICATIONS AND EXPERIENCE: Education: Completion of Advanced University Degree (Master’s or equivalent) is required. Education in Political Science, International Development, Development Economics, International Relations, Law, Marketing, Communications or any relevant field is preferable. Experience: At least 8 years of overall experience, including 6 years of Postgraduate Professional Experience (managerial or supervisory) in areas related to Programme, Partnership, Related roles or other relevant fields. Language: Fluency in spoken and written both in English and Bangla language. Job Title: Programme Policy Officer (Coordination) Grade: SC10 Type of contract: Service Contract Duration: 06 Months Duty Station: Dhaka Number of positions: 01 This vacancy announcement is for only Bangladeshi Nationals. WFP offers a competitive benefits package including salary, leave plus medical insurance. All documents will be verified, and any discrepancies will lead to automatic disqualification. WFP LEADERSHIP FRAMEWORK WFP Leadership Framework guides to the common standards of behavior that guide HOW we work together to accomplish our mission. Click here to access WFP Leadership Framework REASONABLE ACCOMMODATION WFP is committed to supporting individuals with disabilities by providing reasonable accommodations throughout the recruitment process. If you require a reasonable accommodation, please contact: global.inclusion@wfp.org NO FEE DISCLAIMER The United Nations does not charge any application, processing, training, interviewing, testing or other fee in connection with the application or recruitment process. Should you receive a solicitation for the payment of a fee, please disregard it. Furthermore, please note that emblems, logos, names and addresses are easily copied and reproduced. Therefore, you are advised to apply particular care when submitting personal information on the web. REMINDERS BEFORE YOU SUBMIT YOUR APPLICATION We strongly recommend that your profile is accurate, complete, and includes your employment records, academic qualifications, language skills and UN Grade (if applicable). Once your profile is completed, please apply, and submit your application. Please make sure you upload your professional CV in the English language Kindly note the only documents you will need to submit at this time are your CV and Cover Letter Additional documents such as passport, recommendation letters, academic certificates, etc. may potentially be requested at a future time Please contact us at global.hrerecruitment@wfp.org in case you face any challenges with submitting your application Only shortlisted candidates will be notified All employment decisions are made on the basis of organizational needs, job requirements, merit, and individual qualifications. WFP is committed to providing an inclusive work environment free of sexual exploitation and abuse, all forms of discrimination, any kind of harassment, sexual harassment, and abuse of authority. Therefore, all selected candidates will undergo rigorous reference and background checks. No appointment under any kind of contract will be offered to members of the UN Advisory Committee on Administrative and Budgetary Questions (ACABQ), International Civil Service Commission (ICSC), FAO Finance Committee, WFP External Auditor, WFP Audit Committee, Joint Inspection Unit (JIU) and other similar bodies within the United Nations system with oversight responsibilities over WFP, both during their service and within three years of ceasing that service. If you used to have an account on our previous platform, please note that you will need to create a new account for future applications. However, this change will not affect any ongoing recruitment processes. To ensure that WFP is able to deliver on its mandate, a range of contract types exist depending on the duration and nature of work. Find out more here. Our greatest strength is the people working around the world providing access to nutritious food and promoting lasting solutions to those we serve. WFP provides its staff with meaningful and impactful careers, continuous learning and training, and a multicultural and stimulating work environment. WFP celebrates and embraces diversity. It is committed to the principle of equal employment opportunity for all its employees and encourages qualified candidates to apply irrespective of race, colour, national origin, ethnic or social background, genetic information, gender, gender identity and/or expression, sexual orientation, religion or belief, HIV status, physical or mental disability. The United Nations World Food Programme is the 2020 Nobel Peace Prize Laureate. We are the world’s largest humanitarian organization, saving lives in emergencies and using food assistance to build a pathway to peace, stability and prosperity for people recovering from conflict, disasters, and the impact of climate change. Read more about WFP’s history here, and WFP’s mission here Want to hear what it’s like working for WFP? Check out our newsletter highlighting the career stories of our passionate staff here: Pathway to WFP | LinkedIn Integrity, collaboration, commitment, humanity, inclusion. These values inspire everything we do every day, allowing us to work towards a world with zero hunger. You can read more about the values here. Our behaviour guides us in how we accomplish our mission. All WFP employees are expected to demonstrate the standards of behaviour described in the WFP Leadership Framework. Learn more about the WFP Leadership Framework here. WFP is aware of fictitious employment offers being circulated via email or originating from online job boards. Many of these schemes consist of an alleged offer of employment or contract with WFP in return for the payment of fees or providing personal or banking information. Read more.","job_labels":"Programme Policy Development, Stakeholder Engagement, Strategic Planning, Partnership Management, Data-Driven Analysis, Humanitarian Assistance, Sustainable Development Goals, Cross-Cutting Priorities, Resource Diversification, Collaboration And Integration, Advocacy And Outreach, Project Coordination, Capacity Building, Monitoring And Evaluation, Report Writing","short_agency":"WFP","long_agency":"World Food Programme","duty_station":"Bangladesh","duty_country":"Bangladesh","up_grade":"SC1","posting_date":"2025-11-25T00:00:00","apply_until":"2025-12-01T23:59:59","url":"https://wd3.myworkdaysite.com/en-US/recruiting/wfp/job_openings/job/Dhaka-Bangladesh-The-Peoples-R/Programme-Policy-Officer--Coordination---SC10--Dhaka_JR118090","is_active":false,"is_expired":"1","days_remaining":6,"status":"archived","urgency":"urgent","archived":"1","primary_category":null,"secondary_categories":[],"classification_confidence":null,"classification_reasoning":[],"is_user_corrected":false,"user_corrected_by":null,"user_corrected_at":null,"classified_at":null,"is_ambiguous_category":false,"emerging_terms_found":[]},{"id":"64898","title":"Business Support Assistant","description":"DEADLINE FOR APPLICATIONS 7 December 2025-23:59-GMT+02:00 South Africa Standard Time (Maseru) WFP celebrates and embraces diversity. It is committed to the principle of equal employment opportunity for all its employees and encourages qualified candidates to apply irrespective of race, colour, national origin, ethnic or social background, genetic information, gender, gender identity and/or expression, sexual orientation, religion or belief, HIV status or disability. ABOUT WFP The World Food Programme is the world’s largest humanitarian organization saving lives in emergencies and using food assistance to build a pathway to peace, stability and prosperity, for people recovering from conflict, disasters and the impact of climate change. At WFP, people are at the heart of everything we do and the vision of the future WFP workforce is one of diverse, committed, skilled, and high performing teams, selected on merit, operating in a healthy and inclusive work environment, living WFP's values (Integrity, Collaboration, Commitment, Humanity, and Inclusion) and working with partners to save and change the lives of those WFP serves. To learn more about WFP, visit our website: https://www.wfp.org and follow us on social media to keep up with our latest news: YouTube, LinkedIn, Instagram, Facebook, Twitter, TikTok. WHY JOIN WFP? WFP is a 2020 Nobel Peace Prize Laureate. WFP offers a highly inclusive, diverse, and multicultural working environment. WFP invests in the personal &amp; professional development of its employees through a range of training, accreditation, coaching, mentorship, and other programs as well as through internal mobility opportunities. A career path in WFP provides an exciting opportunity to work across the various country, regional and global offices around the world, and with passionate colleagues who work tirelessly to ensure that effective humanitarian assistance reaches millions of people across the globe. We offer an attractive compensation package (please refer to the Terms and Conditions section of this vacancy announcement). He/she will provide support to the delivery of high quality, client-focused, and value for money services pertaining to the Management Services portfolio that enable WFP to deliver food assistance to beneficiaries, in line with WFP’s strategy. Support processing and managing routine administrative and financial tasks in Management Services functional areas, to contribute to the effective and timely management of resources. Provide revision and proof-reading services for standard documents, to contribute to the development of accurate documentation. Create, analyze and compile manual Purchase Requisitions to contribute to the provision of timely payments. Project six months administration accrual services Ensure proper circulation for approval in adherence to WFP internal processes and procedures. Create all non-food manual and WINGS PRs for Admin Unit Facilitate for MPOs creation to contribute to effective and timely payments management. Analyze documents and provide advise where circumstances require certain actions to be undertaken. Create Service Entry Sheets (SESs) on confirmation of receipt of services and Goods Received Notes (GRNs). Analyze POs and MPOs and advise either the Supplier or Procurement team on issues that may hinder the processing of the payments due to PO or invoice errors. Verify correctness of Purchase Orders and Micro Purchase Orders before creation of SESs and GRNs. Follow-up on Suppliers queries and complaints, perform reconciliation to avoid duplication of payments. Process invoice in ITS and match of all invoices once GRNs and SESs have been created.  QUALIFICATIONS AND EXPERIENCE Education: A post-secondary certificate in Business/Public Administration, or other relevant field relating to office management and administration. Experience: At least 4 years of progressively responsible work experience in the relative business stream with experience in general administrative work. Some experience and/or training in Procurement WFP LEADERSHIP FRAMEWORK WFP Leadership Framework guides to the common standards of behavior that guide HOW we work together to accomplish our mission. Click here to access WFP Leadership Framework REASONABLE ACCOMMODATION WFP is committed to supporting individuals with disabilities by providing reasonable accommodations throughout the recruitment process. If you require a reasonable accommodation, please contact: global.inclusion@wfp.org NO FEE DISCLAIMER The United Nations does not charge any application, processing, training, interviewing, testing or other fee in connection with the application or recruitment process. Should you receive a solicitation for the payment of a fee, please disregard it. Furthermore, please note that emblems, logos, names and addresses are easily copied and reproduced. Therefore, you are advised to apply particular care when submitting personal information on the web. REMINDERS BEFORE YOU SUBMIT YOUR APPLICATION We strongly recommend that your profile is accurate, complete, and includes your employment records, academic qualifications, language skills and UN Grade (if applicable). Once your profile is completed, please apply, and submit your application. Please make sure you upload your professional CV in the English language Kindly note the only documents you will need to submit at this time are your CV and Cover Letter Additional documents such as passport, recommendation letters, academic certificates, etc. may potentially be requested at a future time Please contact us at global.hrerecruitment@wfp.org in case you face any challenges with submitting your application Only shortlisted candidates will be notified All employment decisions are made on the basis of organizational needs, job requirements, merit, and individual qualifications. WFP is committed to providing an inclusive work environment free of sexual exploitation and abuse, all forms of discrimination, any kind of harassment, sexual harassment, and abuse of authority. Therefore, all selected candidates will undergo rigorous reference and background checks. No appointment under any kind of contract will be offered to members of the UN Advisory Committee on Administrative and Budgetary Questions (ACABQ), International Civil Service Commission (ICSC), FAO Finance Committee, WFP External Auditor, WFP Audit Committee, Joint Inspection Unit (JIU) and other similar bodies within the United Nations system with oversight responsibilities over WFP, both during their service and within three years of ceasing that service. If you used to have an account on our previous platform, please note that you will need to create a new account for future applications. However, this change will not affect any ongoing recruitment processes. To ensure that WFP is able to deliver on its mandate, a range of contract types exist depending on the duration and nature of work. Find out more here. Our greatest strength is the people working around the world providing access to nutritious food and promoting lasting solutions to those we serve. WFP provides its staff with meaningful and impactful careers, continuous learning and training, and a multicultural and stimulating work environment. WFP celebrates and embraces diversity. It is committed to the principle of equal employment opportunity for all its employees and encourages qualified candidates to apply irrespective of race, colour, national origin, ethnic or social background, genetic information, gender, gender identity and/or expression, sexual orientation, religion or belief, HIV status, physical or mental disability. The United Nations World Food Programme is the 2020 Nobel Peace Prize Laureate. We are the world’s largest humanitarian organization, saving lives in emergencies and using food assistance to build a pathway to peace, stability and prosperity for people recovering from conflict, disasters, and the impact of climate change. Read more about WFP’s history here, and WFP’s mission here Want to hear what it’s like working for WFP? Check out our newsletter highlighting the career stories of our passionate staff here: Pathway to WFP | LinkedIn Integrity, collaboration, commitment, humanity, inclusion. These values inspire everything we do every day, allowing us to work towards a world with zero hunger. You can read more about the values here. Our behaviour guides us in how we accomplish our mission. All WFP employees are expected to demonstrate the standards of behaviour described in the WFP Leadership Framework. Learn more about the WFP Leadership Framework here. WFP is aware of fictitious employment offers being circulated via email or originating from online job boards. Many of these schemes consist of an alleged offer of employment or contract with WFP in return for the payment of fees or providing personal or banking information. Read more.","job_labels":"Administrative Support, Procurement Management, Financial Analysis, Document Revision, Resource Management, Invoice Processing, Purchase Order Verification, Service Entry Sheet Creation, Supplier Relationship Management, Compliance Adherence, Data Compilation, Operational Efficiency, Humanitarian Assistance, Team Collaboration, Process Improvement","short_agency":"WFP","long_agency":"World Food Programme","duty_station":"Lesotho","duty_country":"Lesotho","up_grade":"Other","posting_date":"2025-11-25T00:00:00","apply_until":"2025-12-07T23:59:59","url":"https://wd3.myworkdaysite.com/en-US/recruiting/wfp/job_openings/job/Maseru-Lesotho-The-Kingdom-Of/Business-Support-Assistant_JR116646-1","is_active":false,"is_expired":"1","days_remaining":12,"status":"archived","urgency":"normal","archived":"1","primary_category":null,"secondary_categories":[],"classification_confidence":null,"classification_reasoning":[],"is_user_corrected":false,"user_corrected_by":null,"user_corrected_at":null,"classified_at":null,"is_ambiguous_category":false,"emerging_terms_found":[]},{"id":"64897","title":"International Consultant CSTII Supply Chain Officer, ODS, N'Djamena (Readvertisement)","description":"DEADLINE FOR APPLICATIONS 9 December 2025-23:59-GMT+01:00 West Africa Standard Time (Ndjamena) WFP celebrates and embraces diversity. It is committed to the principle of equal employment opportunity for all its employees and encourages qualified candidates to apply irrespective of race, colour, national origin, ethnic or social background, genetic information, gender, gender identity and/or expression, sexual orientation, religion or belief, HIV status or disability. ABOUT WFP The World Food Programme is the world’s largest humanitarian organization saving lives in emergencies and using food assistance to build a pathway to peace, stability and prosperity, for people recovering from conflict, disasters and the impact of climate change. At WFP, people are at the heart of everything we do and the vision of the future WFP workforce is one of diverse, committed, skilled, and high performing teams, selected on merit, operating in a healthy and inclusive work environment, living WFP's values (Integrity, Collaboration, Commitment, Humanity, and Inclusion) and working with partners to save and change the lives of those WFP serves. To learn more about WFP, visit our website: https://www.wfp.org and follow us on social media to keep up with our latest news: YouTube, LinkedIn, Instagram, Facebook, Twitter, TikTok. WHY JOIN WFP? WFP is a 2020 Nobel Peace Prize Laureate. WFP offers a highly inclusive, diverse, and multicultural working environment. WFP invests in the personal &amp; professional development of its employees through a range of training, accreditation, coaching, mentorship, and other programs as well as through internal mobility opportunities. A career path in WFP provides an exciting opportunity to work across the various country, regional and global offices around the world, and with passionate colleagues who work tirelessly to ensure that effective humanitarian assistance reaches millions of people across the globe. We offer an attractive compensation package (please refer to the Terms and Conditions section of this vacancy announcement). JOB TITLE: Supply Chain Officer TYPE OF CONTRACT: Consultant CLT II UNIT/DIVISION: RBD, Chad DUTY STATION (City, Country): N'Djamena, Chad DURATION: 06 months (Extendable) BACKGROUND AND PURPOSE OF THE ASSIGNMENT World Food Programme (WFP), leveraging its expertise in humanitarian supply chains and extensive field presence, provides comprehensive supply chain services to its humanitarian partners in Chad, supporting them in achieving their objectives. To further this mandate, On-Demand-Service (ODS) provision has been incorporated into the structure of the Chad office in alignment with Strategic Objective 6 of the current Country Strategic Plan (CSP), covering March 2024 through December 2028. These partners include, but are not limited to, United Nations agencies as well as local and international non-governmental organizations. WFP’s supply chain services may encompass procurement, receipt, storage, transportation of various goods, and garage services for partners’ vehicle fleets and fuel requirements. Beyond routine ODS activities described above, WFP has been approached by the United Nations Development Programme (UNDP), via the Global Fund, to manage the receipt of 10,928,670 Insecticide-Treated Mosquito Nets (LLINs) and oversee their delivery to 7,086 distribution points across 168 districts in 23 provinces of Chad. This initiative is funded by UNDP under the Global Fund to Fight AIDS, Tuberculosis, and Malaria. A Service Level Agreement (SLA) has been established to formalize logistics cooperation between UNDP and WFP, supporting both mass and routine mosquito net distribution campaigns in Chad. The total value of this service is approximately USD 2.8 million. Within this project, WFP is responsible for de-stuffing containers at logistics hubs in N’Djamena, Moundou, Mongo, and Abeche, as well as organizing temporary storage and transshipment onto smaller local trucks at each hub. Additionally, WFP will actively contribute to national capacity-building efforts by embedding Ministry of Health personnel within the WFP MILDA team, enabling knowledge transfer through joint operational engagement. ACCOUNTABILITIES /RESPONSIBILITIES Reporting to the Head of Supply Chain, the Supply Chain Officer oversees and coordinates ODS activities. Within delegated authority, the Supply Chain Officer will be responsible for the following responsibilities: Coordination and implementation of On-demand Services (ODS) to all humanitarian partners in country in accordance with WFP rules and regulations. Expansion and improvement of the type of services provided to the humanitarian community in the framework of the ODS (CBT, Procurement, Fuel supplies, transport, warehousing...) Overall management and implementation of all aspects and scope of work related to ODS, staffing, including planning, project budget, risk mitigation measures and timelines. Ensure effective Landside, Transport, Storage and Handling (LTSH) management including project budgetary review. Cooperation with HQ in development of the catalogue of services offered by the CO and the catalogue digitalization Improvement of the visibility and development initiatives of the ODS towards the humanitarian community in Chad. Contribution to preparation of donor communications products for the successful coordination and resourcing of projects. Involvement in the research and implementation of new ODS projects for the CO (The Saving Lives and Livelihoods initiative (SLL), FAO project etc.) Overseeing the planning, coordination, and implementation the Logistics Capacity Assessment of the country in collaboration with all supports services and country office SOs. Involvement and contribution to the updating of the Chad Logistics Market Assessment. Ensure that the item tracking system (RITA) is kept up to date through constant monitoring and analysis of reports to share with all partners. Assess and promote compatibility of WFP tracking tools with the tools used by the government – especially for medical items distribution. Executes day-to-day activities and manages request through SMP and other transactions in WINGS, including the monitoring of all international logistics orders. Manage all service level agreements (SLAs) with humanitarian partners and overseas financial accountability. Responsible for warehouse infrastructure and equipment deployment Focal point for MSUs and other Non-Food Items. Supervise and support ODS staff to ensure that individual and teamwork is carried out in a timely manner. Contribute to the Logistics Working Group and other related coordination meetings. Perform other related duties as assigned. DELIVERABLES AT THE END OF THE CONTRACT -Reconciliation of services provided to the partners. QUALIFICATIONS &amp; EXPERIENCE REQUIRED Education: Advanced University degree in a relevant field, or First University degree with additional years of related work experience and/or trainings/courses. Experience: Typically, five years or more of postgraduate progressively responsible professional experience in a relevant field of work, with a background and interest in international humanitarian response. Experience of managing teams of staff with related areas of expertise. Operational experience in WFP service provision, especially health logistics. Strong organization, communication, and coordination skills. Experience in developing and administering operational budgets. General understanding of logistics and supply chain processes in a humanitarian environment. Effective interpersonal communication and negotiation kills. Proven and demonstrable project management skills. Ability to work to compressed timeframes. Sufficient credibility to advise partners and staff on operational requirements and optimum courses of action; Ability to solve or pre-empt problems Experience or familiarity with WFP On-Demand Services is preferred. Language: International Professional: Fluency in French language. Working knowledge of English. WFP LEADERSHIP FRAMEWORK WFP Leadership Framework guides to the common standards of behavior that guide HOW we work together to accomplish our mission. Click here to access WFP Leadership Framework REASONABLE ACCOMMODATION WFP is committed to supporting individuals with disabilities by providing reasonable accommodations throughout the recruitment process. If you require a reasonable accommodation, please contact: global.inclusion@wfp.org NO FEE DISCLAIMER The United Nations does not charge any application, processing, training, interviewing, testing or other fee in connection with the application or recruitment process. Should you receive a solicitation for the payment of a fee, please disregard it. Furthermore, please note that emblems, logos, names and addresses are easily copied and reproduced. Therefore, you are advised to apply particular care when submitting personal information on the web. REMINDERS BEFORE YOU SUBMIT YOUR APPLICATION We strongly recommend that your profile is accurate, complete, and includes your employment records, academic qualifications, language skills and UN Grade (if applicable). Once your profile is completed, please apply, and submit your application. Please make sure you upload your professional CV in the English language Kindly note the only documents you will need to submit at this time are your CV and Cover Letter Additional documents such as passport, recommendation letters, academic certificates, etc. may potentially be requested at a future time Please contact us at global.hrerecruitment@wfp.org in case you face any challenges with submitting your application Only shortlisted candidates will be notified All employment decisions are made on the basis of organizational needs, job requirements, merit, and individual qualifications. WFP is committed to providing an inclusive work environment free of sexual exploitation and abuse, all forms of discrimination, any kind of harassment, sexual harassment, and abuse of authority. Therefore, all selected candidates will undergo rigorous reference and background checks. No appointment under any kind of contract will be offered to members of the UN Advisory Committee on Administrative and Budgetary Questions (ACABQ), International Civil Service Commission (ICSC), FAO Finance Committee, WFP External Auditor, WFP Audit Committee, Joint Inspection Unit (JIU) and other similar bodies within the United Nations system with oversight responsibilities over WFP, both during their service and within three years of ceasing that service. If you used to have an account on our previous platform, please note that you will need to create a new account for future applications. However, this change will not affect any ongoing recruitment processes. To ensure that WFP is able to deliver on its mandate, a range of contract types exist depending on the duration and nature of work. Find out more here. Our greatest strength is the people working around the world providing access to nutritious food and promoting lasting solutions to those we serve. WFP provides its staff with meaningful and impactful careers, continuous learning and training, and a multicultural and stimulating work environment. WFP celebrates and embraces diversity. It is committed to the principle of equal employment opportunity for all its employees and encourages qualified candidates to apply irrespective of race, colour, national origin, ethnic or social background, genetic information, gender, gender identity and/or expression, sexual orientation, religion or belief, HIV status, physical or mental disability. The United Nations World Food Programme is the 2020 Nobel Peace Prize Laureate. We are the world’s largest humanitarian organization, saving lives in emergencies and using food assistance to build a pathway to peace, stability and prosperity for people recovering from conflict, disasters, and the impact of climate change. Read more about WFP’s history here, and WFP’s mission here Want to hear what it’s like working for WFP? Check out our newsletter highlighting the career stories of our passionate staff here: Pathway to WFP | LinkedIn Integrity, collaboration, commitment, humanity, inclusion. These values inspire everything we do every day, allowing us to work towards a world with zero hunger. You can read more about the values here. Our behaviour guides us in how we accomplish our mission. All WFP employees are expected to demonstrate the standards of behaviour described in the WFP Leadership Framework. Learn more about the WFP Leadership Framework here. WFP is aware of fictitious employment offers being circulated via email or originating from online job boards. Many of these schemes consist of an alleged offer of employment or contract with WFP in return for the payment of fees or providing personal or banking information. Read more.","job_labels":"Supply Chain Management, Logistics Coordination, Humanitarian Assistance, Project Management, Procurement, Capacity Building, Operational Budgeting, Stakeholder Engagement, Inventory Management, Transportation Logistics, Team Leadership, Service Level Agreements, Data Analysis, Risk Mitigation, Communication Skills","short_agency":"WFP","long_agency":"World Food Programme","duty_station":"Chad","duty_country":"Chad","up_grade":"Consultant","posting_date":"2025-11-25T00:00:00","apply_until":"2025-12-09T23:59:59","url":"https://wd3.myworkdaysite.com/en-US/recruiting/wfp/job_openings/job/NDjamena-Chad-The-Republic-Of/International-Consultant-CSTII-Supply-Chain-Officer--ODS--N-Djamena--Readvertisement-_JR118100-1","is_active":false,"is_expired":"1","days_remaining":14,"status":"archived","urgency":"normal","archived":"1","primary_category":null,"secondary_categories":[],"classification_confidence":null,"classification_reasoning":[],"is_user_corrected":false,"user_corrected_by":null,"user_corrected_at":null,"classified_at":null,"is_ambiguous_category":false,"emerging_terms_found":[]},{"id":"64896","title":"WFP Seoul Office - Partnerships Officer NOA","description":"DEADLINE FOR APPLICATIONS 10 December 2025-23:59-GMT+09:00 Korean Standard Time (Seoul) WFP celebrates and embraces diversity. It is committed to the principle of equal employment opportunity for all its employees and encourages qualified candidates to apply irrespective of race, colour, national origin, ethnic or social background, genetic information, gender, gender identity and/or expression, sexual orientation, religion or belief, HIV status or disability. ABOUT WFP The World Food Programme is the world’s largest humanitarian organization saving lives in emergencies and using food assistance to build a pathway to peace, stability and prosperity, for people recovering from conflict, disasters and the impact of climate change. At WFP, people are at the heart of everything we do and the vision of the future WFP workforce is one of diverse, committed, skilled, and high performing teams, selected on merit, operating in a healthy and inclusive work environment, living WFP's values (Integrity, Collaboration, Commitment, Humanity, and Inclusion) and working with partners to save and change the lives of those WFP serves. To learn more about WFP, visit our website: https://www.wfp.org and follow us on social media to keep up with our latest news: YouTube, LinkedIn, Instagram, Facebook, Twitter, TikTok. WHY JOIN WFP? WFP is a 2020 Nobel Peace Prize Laureate. WFP offers a highly inclusive, diverse, and multicultural working environment. WFP invests in the personal &amp; professional development of its employees through a range of training, accreditation, coaching, mentorship, and other programs as well as through internal mobility opportunities. A career path in WFP provides an exciting opportunity to work across the various country, regional and global offices around the world, and with passionate colleagues who work tirelessly to ensure that effective humanitarian assistance reaches millions of people across the globe. We offer an attractive compensation package (please refer to the Terms and Conditions section of this vacancy announcement). We are seeking to fill the position of Partnerships Officer NOA, based in the WFP Global Office in Seoul, Republic of Korea. Please note that this vacancy announcement is being issued internally and externally. Only applications received in English will be considered. ORGANIZATIONAL CONTEXT These jobs are part of Global Headquarters (GHQ) and Seoul Global Office and reports to the Director of WFP Global Office in Seoul or designate. Job holders primarily carry out day–to-day partnerships activities and research. They engage with internal stakeholders and a host of public, private sector and external entities. These can comprise governments, UN agencies, intergovernmental institutions and their member states, international financial institutions, individuals, corporations, foundations and NGOs. Partnerships Officers are likely to focus on either public, private sector or external entities. Under the direct supervision of the Director of WFP Global Office in Seoul (SEO), the Partnerships Officer (NOA) will perform the duties outlined in the below sections. THE ROLE Facilitate the work of senior staff to effectively position WFP with public, private and external partners to attract policy support, resources, technical assistance and innovative solutions to advance the work of WFP, while supporting member states in the achievement of the SDGs and Zero Hunger and emphasizing WFP’s contributions in this regard. KEY ACCOUNTABILITIES (not all-inclusive, within delegated authority): Implement the political and private sector engagement work plan to enable WFP to identify, develop and strengthen quality partnerships in support of WFP strategic objectives. Proactively contribute to a partnerships portfolio, including partner profiling and outreach activities, with the aim to maximize resources and leverage policy and technical support for WFP’s work; support partner visibility and ensure partner conditions are met. Use data to present managers with well-researched ideas to expand support from existing partners and to scope new partners, guided by programmatic assessment and context-specific analysis with the aim to enhance the impact of WFP’s work and diversify the resource base. Solicit inputs, including operational updates, from other WFP entities to inform partner audiences on WFP’s programmatic offering; draft quality briefs and proactively highlight strategic issues to senior staff to inform best course of action and nurture partnership growth. Gather and present internal and external data/information including partner intelligence (including forecasting), using key information systems (e.g. Salesforce, WINGS, WFPGo), to support WFP’s effective positioning vis-à-vis national governments, regional and international institutions with the aim to influence the policy agenda. In the context of the UN system and multilateral fora, support the development of partnerships and joint events with member states, civil society and intergovernmental organizations to advocate for the SDGs and Zero Hunger on the global agenda and advance WFP priorities and objectives. Contribute to partnerships strategies, including the development of Partnership Action Plans; draw up quality partner proposals and reports by engaging with other WFP entities and external stakeholders. Support SEO Director in the preparation of strategic agreements, joint strategies and MOUs in order to promote the SDGs and Zero Hunger on the national, regional and global agenda and to reach advantageous outcomes for WFP. Contribute to preparedness actions, providing technical recommendations and guidance, and monitor defined risks. Other as required. OTHER SPECIFIC JOB REQUIREMENTS (details determined by the Post Manager): Identify engagement opportunities in the Republic of Korea (R.O.K) context and support the implementation of WFP’s political engagement strategy by coordinating with partners such as the National Assembly, Ministry of Economy and Finance, civil society, private sector, and foundations. Collaborate with other Partnership and Innovation (PI) functional entities, Regional Offices (ROs) and Country Offices (COs) on enhancing WFP’s branding and visibility in the R.O.K. market including the effective management of Good Will Ambassadors, in close coordination with the Communications Officer. Guide and supervise more junior staff, acting as a point of referral and supporting them with more complex analysis and queries. STANDARD MINIMUM QUALIFICATIONS AND EXPERIENCE: Education: Advanced University degree in Political Science, International Development, Development Economics, International Relations, Law, Marketing, Communications or other relevant field, or First University degree with additional years of related work experience and/or trainings/courses. Experience: Minimum one or more years of relevant professional work experience in partnership roles. Essential Requirements Basic understanding of R.O.K. government policies and political landscape Foundational knowledge of private sector Environmental, Social, Governance (ESG)/Corporate Social Responsibility (CSR) strategies and market trends. Experience with governmental organizations, national assembly, and private partners in R.O.K. Experience participating and assisting in negotiations for contributions and partnership agreements with donors and host governments, in line with internal policies and external regulations. Desirable Requirements Has developed effective relationships with partners and explored new areas to scale-up existing activities and researched new opportunities. Has developed powerful narratives by using data analysis visualization to enable action-oriented discussions with partners. Has provided resourcing analysis and collaborated with accurate and timely briefs as well as reporting to donors. Has motivated team spirit and contributed to a gender-balanced, inclusive and sound working environment. Language: Fluency (level C) in English and in Korean. TERMS AND CONDITIONS Please note that this is a local recruitment for a National Officer position; therefore applicants must: a) be Korean citizen; and b) reside within commuting distance of the duty station in Seoul, R.O.K. (Gwanakro 1, 411 153, Gwanak-gu, Seoul, Republic of Korea), or already live in the country and be willing to relocate to Seoul at their own expense before taking up the assignment. Preference will be given to candidates who already reside within commuting distance of the duty station. Please note that WFP will not cover relocation or living expenses and will not provide assistance in obtaining and extending residency status or work permits. Working arrangement: The position requires physical presence at the office at a minimum of 3 days a week, and working remotely will be only granted only two days per week. WFP offers a competitive compensation package, determined by the contract type and the selected candidate’s qualifications and experience. Seoul National Officer category salary scale: UN Salary Scale. WFP LEADERSHIP FRAMEWORK WFP Leadership Framework guides to the common standards of behavior that guide HOW we work together to accomplish our mission. Click here to access WFP Leadership Framework REASONABLE ACCOMMODATION WFP is committed to supporting individuals with disabilities by providing reasonable accommodations throughout the recruitment process. If you require a reasonable accommodation, please contact: global.inclusion@wfp.org NO FEE DISCLAIMER The United Nations does not charge any application, processing, training, interviewing, testing or other fee in connection with the application or recruitment process. Should you receive a solicitation for the payment of a fee, please disregard it. Furthermore, please note that emblems, logos, names and addresses are easily copied and reproduced. Therefore, you are advised to apply particular care when submitting personal information on the web. REMINDERS BEFORE YOU SUBMIT YOUR APPLICATION We strongly recommend that your profile is accurate, complete, and includes your employment records, academic qualifications, language skills and UN Grade (if applicable). Once your profile is completed, please apply, and submit your application. Please make sure you upload your professional CV in the English language Kindly note the only documents you will need to submit at this time are your CV and Cover Letter Additional documents such as passport, recommendation letters, academic certificates, etc. may potentially be requested at a future time Please contact us at global.hrerecruitment@wfp.org in case you face any challenges with submitting your application Only shortlisted candidates will be notified All employment decisions are made on the basis of organizational needs, job requirements, merit, and individual qualifications. WFP is committed to providing an inclusive work environment free of sexual exploitation and abuse, all forms of discrimination, any kind of harassment, sexual harassment, and abuse of authority. Therefore, all selected candidates will undergo rigorous reference and background checks. No appointment under any kind of contract will be offered to members of the UN Advisory Committee on Administrative and Budgetary Questions (ACABQ), International Civil Service Commission (ICSC), FAO Finance Committee, WFP External Auditor, WFP Audit Committee, Joint Inspection Unit (JIU) and other similar bodies within the United Nations system with oversight responsibilities over WFP, both during their service and within three years of ceasing that service. If you used to have an account on our previous platform, please note that you will need to create a new account for future applications. However, this change will not affect any ongoing recruitment processes. To ensure that WFP is able to deliver on its mandate, a range of contract types exist depending on the duration and nature of work. Find out more here. Our greatest strength is the people working around the world providing access to nutritious food and promoting lasting solutions to those we serve. WFP provides its staff with meaningful and impactful careers, continuous learning and training, and a multicultural and stimulating work environment. WFP celebrates and embraces diversity. It is committed to the principle of equal employment opportunity for all its employees and encourages qualified candidates to apply irrespective of race, colour, national origin, ethnic or social background, genetic information, gender, gender identity and/or expression, sexual orientation, religion or belief, HIV status, physical or mental disability. The United Nations World Food Programme is the 2020 Nobel Peace Prize Laureate. We are the world’s largest humanitarian organization, saving lives in emergencies and using food assistance to build a pathway to peace, stability and prosperity for people recovering from conflict, disasters, and the impact of climate change. Read more about WFP’s history here, and WFP’s mission here Want to hear what it’s like working for WFP? Check out our newsletter highlighting the career stories of our passionate staff here: Pathway to WFP | LinkedIn Integrity, collaboration, commitment, humanity, inclusion. These values inspire everything we do every day, allowing us to work towards a world with zero hunger. You can read more about the values here. Our behaviour guides us in how we accomplish our mission. All WFP employees are expected to demonstrate the standards of behaviour described in the WFP Leadership Framework. Learn more about the WFP Leadership Framework here. WFP is aware of fictitious employment offers being circulated via email or originating from online job boards. Many of these schemes consist of an alleged offer of employment or contract with WFP in return for the payment of fees or providing personal or banking information. Read more.","job_labels":"Partnership Management, Stakeholder Engagement, Resource Mobilization, Policy Advocacy, Strategic Planning, Data Analysis, Program Development, Communication Strategies, Negotiation Skills, Project Coordination, International Relations, Public-Private Partnerships, Capacity Building, Monitoring And Evaluation, Humanitarian Assistance","short_agency":"WFP","long_agency":"World Food Programme","duty_station":"Seoul","duty_country":"Republic of Korea","up_grade":"NOA","posting_date":"2025-11-25T00:00:00","apply_until":"2025-12-10T23:59:59","url":"https://wd3.myworkdaysite.com/en-US/recruiting/wfp/job_openings/job/Seoul-Korea-Republic-of/WFP-Seoul-Office---Partnerships-Officer-NOA_JR118118-2","is_active":false,"is_expired":"1","days_remaining":15,"status":"archived","urgency":"normal","archived":"1","primary_category":null,"secondary_categories":[],"classification_confidence":null,"classification_reasoning":[],"is_user_corrected":false,"user_corrected_by":null,"user_corrected_at":null,"classified_at":null,"is_ambiguous_category":false,"emerging_terms_found":[]}],"timestamp":"2025-11-26T01:32:47.340Z","pagination":{"page":1,"limit":5,"total":17292,"totalPages":3459}}